/***********************************************************\
 * © 1993 Adobe Systems Incorporated. All rights reserved. *
 *                                                         *
 *   Core Flash Player localizable strings                 *
\***********************************************************/

/////////////////////////////////////////////////////////////
// BLOCK 1: User Interface strings                         //
/////////////////////////////////////////////////////////////

// Shared strings
"GenericDialog_Header"						= "Adobe Flash Player %@";

// Local security dialog
"LocalSecurity_Title"						= "Безопасность Adobe Flash Player";
"LocalSecurity_Line1"						= "Adobe® Flash® Player остановил потенциально небезопасную операцию. Следующее локальное приложение на компьютере или в сети:";
"LocalSecurity_Line2"						= "пытается связаться с этим местоположением с поддержкой Интернета:";
"LocalSecurity_Line3"						= "Чтобы разрешить приложению доступ в Интернет, выберите \"Настройки\".\nПосле изменения настроек необходимо перезапустить данное приложение.";

"LocalSecurity_SettingsBtn"					= "Параметры…";
"LocalSecurity_OKBtn"						= "OK";

// Flash Exception dialog
"ActionScriptErrorLabel"					= "Произошла ошибка ActionScript:";
"ExceptionDialog_DismissAllButton"			= "Закрыть все";
"ExceptionDialog_ContinueButton"			= "Продолжить";

// Script taking too long dialog
"StuckScript_Message"						= "Этот ролик содержит сценарий, замедляющий работу Adobe® Flash® Player 10.  Если продолжить его выполнение, то компьютер может перестать отвечать на запросы.\n\nПрервать сценарий?";
"StuckScript_YesBtn"						= "Да";
"StuckScript_NoBtn"							= "Нет";

// Debug or profile connection failed dialog
"DebugFailed_Header"						= "Adobe® Flash® Player";
"DebugFailed_Message"						= "Adobe Flash Player 10 не удалось подключиться к отладчику или профилировщику.";

// Debugger connection dialog
"ShowDialogAtLaunchText"					= "Показывать это диалоговое окно при запуске";
"ConnectToDebuggerText"						= "Подключиться к отладчику";
"DebuggerLocationText"						= "Расположение отладчика или ведущего приложения:";
"LocationLocalText"							= "На этом компьютере (локальный компьютер)";
"LocationRemoteText"						= "IP-адрес:";
"ContinueButtonTitle"						= "Продолжить";

// Can't find preference pane alert
"CantFindPrefPane_Title"					= "Unable to Load Flash Player Preferences Pane";
"CantFindPrefPane_Message"					= "To access your global settings, re-install Adobe Flash Player. It can be downloaded from http://www.adobe.com/go/getflashplayer";

// ----------------------------------------------------------
"IDS_FILE_CHOOSER_TITLE"					= "Выбрать файлы";
"IDS_DIR_CHOOSER_TITLE"						= "Выбрать папку";
"IDS_CHOOSER_SELECT_BUTTON"					= "Выбрать";

// ----------------------------------------------------------
"IDS_FILE_UPLOAD_CHOOSER"					= "Выберите файл для отправки с помощью ";
"IDS_FILE_UPLOAD_CHOOSER_MULTI_SELECT"		= "Выберите файлы для отправки с помощью ";
"IDS_FILE_DOWNLOAD_SAVE"					= "Выберите местоположение для загрузки с помощью ";
"IDS_DOWNLOAD_FILE_SAVE_CLASSIC_PLUGIN"		= "Выберите местоположение для загрузки";

// ----------------------------------------------------------

/////////////////////////////////////////////////////////////
// BLOCK 2: Error strings                                  //
/////////////////////////////////////////////////////////////

"IDS_CONSOLE_CASE"							= "– Вероятно несоответствие регистра.";
"IDS_CONSOLE_SANDBOX"						= "*** Нарушение безопасности изолированной среды ***";
"IDS_CONSOLE_NOT_PERMITTED"					= "Подключение к %s прервано – нет разрешения от %s";
"IDS_CONSOLE_TITLE"							= "Консоль отладки Flash Player";
"IDS_CONSOLE_FSCOMMAND_HALTED"				= "FSCommand прервана (AllowScriptAccess = \\\"%s\\\"): %s";
"IDS_CONSOLE_URL_HALTED"					= "URL сценария прерван (AllowScriptAccess = \\\"%s\\\"): %s";
"IDS_CONSOLE_SECURITY_CONTEXT"				= "SecurityDomain \\\"%s\\\" пытался получить доступ к несовместимому контексту \\\"%s\\\"";
"IDS_CONSOLE_SECURITY_NULL"					= "SecurityDomain \\\"%s\\\" пытался получить доступ к контексту NULL";
"IDS_CONSOLE_SECURITY_PLAYER"				= "SecurityDomain \\\"%s\\\" пытался получить доступ к контексту Player UI (интерфейс пользователя проигрывателя)";
"IDS_CONSOLE_WARN_NO_PROP"					= "Предупреждение: \\\"%s\\\" не имеет свойства \\\"%s\\\"";
"IDS_CONSOLE_WARN_NOT_A_FUNC"				= "Предупреждение: %s не является функцией";
"IDS_CONSOLE_WARN_NOT_DEFINED"				= "Предупреждение: %s не определено";
"IDS_CONSOLE_WARN_400"						= "Предупреждение: 400 – Ошибочный запрос: %s";
"IDS_CONSOLE_WARN_401"						= "Предупреждение: 401 – Не санкционировано: %s";
"IDS_CONSOLE_WARN_402"						= "Предупреждение: 402 – Требуется оплата: %s";
"IDS_CONSOLE_WARN_403"						= "Предупреждение: 403 – Запрещено: %s";
"IDS_CONSOLE_WARN_404"						= "Предупреждение: 404 – Не найдено: %s";
"IDS_CONSOLE_WARN_405"						= "Предупреждение: 405 – Недопустимый метод, недопустимый тип MIME: %s";
"IDS_CONSOLE_WARN_406"						= "Предупреждение: 406 – Неприемлемо: %s";
"IDS_CONSOLE_WARN_500"						= "Предупреждение: 500 – Ошибка сервера: %s";
"IDS_CONSOLE_WARN_501"						= "Предупреждение: 501 – Не реализовано: %s";
"IDS_CONSOLE_WARN_502"						= "Предупреждение: 502 – Недопустимый шлюз: %s";
"IDS_CONSOLE_WARN_503"						= "Предупреждение: 503 – Недостаточно ресурсов: %s";
"IDS_CONSOLE_WARN_504"						= "Предупреждение: 504 – Истекло время ожидания шлюза: %s";
"IDS_CONSOLE_WARN_505"						= "Предупреждение: 505 – Версия HTTP не поддерживается: %s";
"IDS_CONSOLE_WARN_NO_CONNECT"				= "Предупреждение: Не удалось установить связь, %s";
"IDS_CONSOLE_WARN_FAIL_ALLOCATE_URL"		= "Предупреждение: Не удалось выделить URL-путь";
"IDS_CONSOLE_WARN_CORRUPT_DATA"				= "Предупреждение: Не удалось выполнить анализ поврежденных данных.";
"IDS_CONSOLE_WARN_FAIL_PLACE"				= "Предупреждение: Не удалось поместить объект на глубину %d.";
"IDS_CONSOLE_WARN_FAIL_PLACE_MISSING_CHAR" 	= "Предупреждение: Не удалось поместить объект: отсутствует символ";
"IDS_CONSOLE_WARN_FTP_FILE"					= "Предупреждение: Ошибка открытия файла FTP, %s";
"IDS_CONSOLE_WARN_HTTP_REQUEST"				= "Предупреждение: Ошибка открытия запроса HTTP, %s";
"IDS_CONSOLE_WARN_HTTP_QUERY"				= "Предупреждение: Ошибка запроса сведений HTTP, %s";
"IDS_CONSOLE_WARN_HTTP_SEND"				= "Предупреждение: Ошибка отправки запроса HTTP, %d: %s";
"IDS_CONSOLE_WARN_NET_CONNECT"				= "Предупреждение: Ошибка подключения к Интернету, %s";
"IDS_CONSOLE_WARN_NET_OPEN"					= "Предупреждение: Ошибка открытия Интернета";
"IDS_CONSOLE_WARN_UNKNOWN_DOWNLOAD_TYPE"	= "Предупреждение: Неизвестный тип загрузки проигрывателя, %s";
"IDS_CONSOLE_WARN_BAD_PORT"					= "Предупреждение: Порт %d выходит за пределы допустимого диапазона.";
"IDS_CONSOLE_WARN_WARNING_LIMIT"			= "Предупреждение: Достигнут порог предупреждения %d";
"IDS_CONSOLE_WARN_UNDECLARED_PROP"			= "Предупреждение: Ссылка на необъявленное свойство, \\\"%s\\\"";
"IDS_CONSOLE_WARN_UNDECLARED_VAR"			= "Предупреждение: Ссылка на необъявленную переменную, \\\"%s\\\"";
"IDS_CONSOLE_WARN_SOCKET_ERROR"				= "Предупреждение: Ошибка сокета, %s";
"IDS_CONSOLE_WARN_STACK"					= "Предупреждение: Переполнение стека";
"IDS_CONSOLE_WARN_HOST"						= "Предупреждение: Не удалось разрешить имя узла: %s";
"IDS_CONSOLE_WARN_GENERIC_HOST"				= "Предупреждение: Не удалось разрешить имя узла";
"IDS_CONSOLE_WARN_EXCEPTION"				= "Предупреждение: Неперехваченное исключение, %s";
"IDS_CONSOLE_WARN_HTTP_STATUS"				= "Предупреждение: Нераспознанное состояние HTTP %d: %s";
"IDS_CONSOLE_WARN_NO_URL"					= "Предупреждение: Нет URL-пути";
"IDS_CONSOLE_SECURITY_DIALOG"				= "Обнаружено старое сопоставление доменов – %s пытается получить доступ к %s";
"IDS_CONSOLE_LOCAL_OUTBOUND"				= "– Ненадежные локальные SWF-файлы не могут связываться с Интернетом.";
"IDS_CONSOLE_LOCAL_INBOUND"					= "– Удаленным SWF-файлам не разрешается получать доступ к локальным файлам.";
"IDS_CONSOLE_WARN_AVM1_LOADED_AVM2"			= "Предупреждение: SWF-файл ActionScript 1.0/2.0 загрузил SWF-файл ActionScript 3.0; код в SWF-файле ActionScript 3.0 выполняться не будет.";
"IDS_CONSOLE_WINDOW_HALTED"					= "URL для окна \\\"%s\\\" прерван (AllowScriptAccess = \\\"%s\\\"): %s";
"IDS_CONSOLE_ALLOW_NETWORK"					= "– Это из-за значения \\\"allowNetworking\\\".";
"IDS_CONSOLE_NO_POLICY_FILE"				= "Не удалось загрузить файл политики из %s";
"IDS_CONSOLE_BAD_POLICY_FILE"				= "[строгий] Игнорирование файла политики на %s из-за неправильного синтаксиса. Сведения об устранении этой проблемы см. на веб-сайте http://www.adobe.com/go/strict_policy_files_ru.";
"IDS_CONSOLE_PREFIX_OK"						= "ОК: ";
"IDS_CONSOLE_PREFIX_WARNING"				= "Предупреждение: ";
"IDS_CONSOLE_PREFIX_ERROR"					= "Ошибка: ";
"IDS_CONSOLE_GOOD_POLICY_FILE"				= "Файл политики принят: %s";
"IDS_CONSOLE_BAD_POLICY_FILE_TYPE"			= "[строгий] Игнорирование файла политики на %s из-за недопустимого типа содержимого \\\"%s\\\". Сведения об устранении этой проблемы см. на веб-сайте http://www.adobe.com/go/strict_policy_files_ru.";
"IDS_CONSOLE_NO_POLICY_FILE_TYPE"			= "[строгий] Игнорирование файла политики на %s из-за отсутствия типа содержимого.  Сведения об устранении этой проблемы см. на веб-сайте http://www.adobe.com/go/strict_policy_files_ru.";
"IDS_CONSOLE_POLICY_FILE_NO_HEADERS"		= "Заголовки ответов HTTP недоступны на этой платформе.  Строгие правила файла политики не могут быть применены.";
"IDS_CONSOLE_POLICY_FILE_REDIRECT"			= "[строгий] Файл политики, запрошенный из %s, перенаправлен %s; будет использоваться конечный URL-адрес в определении области.  Сведения об устранении этой проблемы см. на веб-сайте http://www.adobe.com/go/strict_policy_files_ru.";
"IDS_CONSOLE_POLICY_FILE_CROSS_DOMAIN"		= "Игнорирование файла политики, запрошенного от %s, из-за междоменного перенаправления к %s.";
"IDS_CONSOLE_TOP_URL"						= "Выполнена загрузка SWF-файла корневого уровня: %s";
"IDS_CONSOLE_META_POLICY_HDR_UNKNOWN"		= "Нераспознанная метаполитика в заголовке HTTP от %s: %s";
"IDS_CONSOLE_META_POLICY_HDR_FTP"			= "Заголовок HTTP от %s задает метаполитику \\\"by-ftp-filename\\\" (по имени файла), которая применима только к FTP, но не к HTTP.";
"IDS_CONSOLE_META_POLICY_HDR_CONFLICT"		= "Конфликт метаполитики в заголовке HTTP от %s: %s";
"IDS_CONSOLE_META_POLICY_HDR_PREV"			= "Конфликт между метаполитикой %s в заголовке HTTP от %s и ранее установленной метаполитикой %s";
"IDS_CONSOLE_POLICY_FILE_NONE_THIS_RSP"		= "Игнорирование файла политики на %s из-за междоменных политик X-Permitted: none-this-response (не этот ответ)";
"IDS_CONSOLE_POLICY_FILE_SITE_NONMASTER"	= "Игнорирование тега <site-control> в файле политики от %s.  Этот тег разрешен только в файлах групповой политики.";
"IDS_CONSOLE_META_POLICY_BAD_BY_TYPE"		= "Игнорирование тега <site-control> в файле политики от %s.  Метаполитика \\\"by-content-type\\\" (по типу содержимого) применяется только к HTTP-сайтам.";
"IDS_CONSOLE_META_POLICY_BAD_BY_FTP"		= "Игнорирование тега <site-control> в файле политики от %s.  Метаполитика \\\"by-ftp-filename\\\" (по имени файла) применяется только к FTP-сайтам.";
"IDS_CONSOLE_META_POLICY_BAD_THIS_RESPONSE"	= "Игнорирование тега <site-control> в файле политики от %s.  Метаполитика \\\"none-this-response\\\" (не этот ответ) разрешена только в заголовке ответов HTTP междоменных политик X-Permitted.";
"IDS_CONSOLE_META_POLICY_FILE_UNKNOWN"		= "Нераспознанная метаполитика в файле политики от %s: %s";
"IDS_CONSOLE_META_POLICY_FILE_PREV"			= "Конфликт между метаполитикой %s в файле политики от %s и ранее установленной метаполитикой %s";
"IDS_CONSOLE_META_POLICY_DEFAULT"			= "Для домена %s не указана метаполитика. Применяется метаполитика по умолчанию \\\"master only\\\" (\\\"только мастер\\\"). Эта конфигурация исключается. Чтобы исправить эту проблему, перейдите на веб-страницу http://www.adobe.com/go/strict_policy_files_ru.";
"IDS_CONSOLE_POLICY_FILE_SOCK_NONE_NO"		= "SWF-файлу от %s не удалось подключиться к сокету в своем собственном домене без файла политики.  Сведения об устранении этой проблемы см. на веб-сайте http://www.adobe.com/go/strict_policy_files_ru.";
"IDS_CONSOLE_POLICY_FILE_SOCK_TIMEOUT"		= "На %s истекло время (3 сек) ожидания файла политики для сокета.  Это не должно привести к каким-либо проблемам, однако см. описание на веб-сайте http://www.adobe.com/go/strict_policy_files_ru.";
"IDS_CONSOLE_META_POLICY_IMPLICIT"			= "Домен %s явно не задает метаполитику, но типом содержимого файла политики %s является \\\"text/x-cross-domain-policy\\\".  Применение метаполитики \\\"by-content-type\\\" (по типу содержимого).";
"IDS_CONSOLE_META_POLICY_REJECT"			= "Игнорирование файла политики на %s из-за метаполитики \\\"%s\\\".";
"IDS_CONSOLE_POLICY_FILE_TOO_BIG"			= "Игнорирование файла политики для сокета на %s из-за его слишком большого размера.  Размер файла политики для сокета не может превышать 20 килобайт.";
"IDS_CONSOLE_MASTER_SELF_INVALIDATED"		= "Файл политики на %s делает недействительными свои собственные директивы <allow-access-from> (разрешить доступ из), декларируя метаполитику \\\"none\\\" (отсутствует).";
"IDS_CONSOLE_POLICY_FILE_BAD_PORT_SPEC"		= "Игнорирование указания недопустимого номера порта \\\"%s\\\" в файле политики на %s.";
"IDS_CONSOLE_POLICY_FILE_BAD_ALLOW"			= "Недействительный тег <%s> для домена \\\"%s\\\" в файле политики в папке %s игнорируется";
"IDS_CONSOLE_REQUEST_ALLOWED_BY_POLICY"		= "Запрос ресурса на %s источника запроса из %s разрешен согласно файлу политики на %s";
"IDS_CONSOLE_REQUEST_DENIED_NO_POLICY"		= "Запрос ресурса на %s источника запроса из %s отклонен из-за отсутствия разрешений в файле политики.";
"IDS_CONSOLE_SOCKET_UNAVAILABLE"			= "Запрос ресурса на %s источника запроса из %s выполнить не удалось, поскольку сервер недоступен.";
"IDS_CONSOLE_NO_ASFUNCTION"					= "Отклонение URL-адреса %s, поскольку протокол \\\"asfunction:\\\" может использоваться только для целей ссылок, но не для сетевых интерфейсов API.";
"IDS_CONSOLE_POLICY_BAD_SECURE_ATTR"		= "Игнорирование атрибута \\\"secure\\\" (безопасность) в файле политики от %s.  Атрибут \\\"secure\\\" разрешен только в файлах политики для сокета и HTTPS.  Дополнительные сведения см. на веб-сайте http://www.adobe.com/go/strict_policy_files_ru.";
"IDS_CONSOLE_POLICY_SOCK_SECURE_ATTR"		= "В файле политики от %s обнаружено secure=\\\"true\\\", но узел %s, по видимому, не является локальным компьютером.  Это может быть небезопасно.  Дополнительные сведения см. на веб-сайте http://www.adobe.com/go/strict_policy_files_ru.";
"IDS_CONSOLE_POLICY_REASON_DATA"			= "Выполняется поиск директив <allow-access-from> в файлах политики, чтобы авторизовать загрузку данных из ресурса по адресу %s инициатором запроса из %s";
"IDS_CONSOLE_POLICY_REASON_HEADERS"			= "Выполняется поиск директив <allow-http-request-headers-from> в файлах политики, чтобы авторизовать отправку заголовка по URL-адресу %s инициатором запроса из %s";
"IDS_CONSOLE_QUESTIONABLE_SCRIPTING"		= "-- URL-адреса сценариев браузера могут выполняться только с помощью функций getURL и navigateToURL.";
"IDS_CONSOLE_WARN_ALLOW_NEVER"				= "Предупреждение. В коде HTML содержится выражение AllowScriptAccess=\\\"never\\\". Эта недействительная настройка исключается. Подробную информацию см. на странице http://www.adobe.com/go/allowscriptaccess_ru.";
"IDS_CONSOLE_WARN_ALLOW_SAMEDOM"			= "Предупреждение. В коде HTML найдено выражение AllowNetworking=\\\"%s\\\". HTML-файлы и SWF-файлы находятся в одном и том же домене. Эта недействительная настройка исключается. Подробную информацию см. на странице http://www.adobe.com/go/allowscriptaccess_ru.";
"IDS_CONSOLE_WARN_3D_SURFACE_TOO_BIG"		= "Предупреждение: трехмерный объект DisplayObject не может быть визуализирован. Его размеры (%s, %s) превышают допустимые размеры для отрисовки.";
"IDS_CONSOLE_WARN_FILTER_TOO_BIG"			= "Предупреждение: фильтр не может быть визуализирован. Фильтруемые размеры объекта DisplayObject (%s, %s) превышают допустимые размеры для отрисовки.";
"IDS_CONSOLE_FORCE_DOWNLOAD_WAS_SET"		= "Не удалось загрузить %s, так как в заголовке Content-Disposition было указано значение attachment.";
"IDS_CONSOLE_USER_ACTION_REQUIRED"			= "Определённые действия, например, те, после которых появляется всплывающее окно, могут быть только результатом взаимодействия с  пользователем, к таким действиям относятся щелчок мышью или нажатие кнопки.";
"IDS_LOCALCONNECTION_USERSCOPED_LOCKED"     = "Значение LocalConnection.isPerUser невозможно изменить, так как оно заблокировано вызовом LocalConnection.connect, .send или .close.";
"IDS_CONSOLE_POLICY_FILE_BAD_PF_URL"		= "Игнорирование файла политики с URL-адресом не в формате ASCII%s";
"IDS_CONSOLE_POLICY_FILE_BAD_DATA_URL"		= "Не удается разрешить операцию с URL-адресом не в формате ASCII %s";
